API_test/exemplo_webservice/exemploSOAP/requestAdd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exa="http://example.com/myservice">
   <soapenv:Header/>
   <soapenv:Body>
      <exa:AddRequest>
         <exa:a>3</exa:a>
         <exa:b>4</exa:b>
      </exa:AddRequest>
   </soapenv:Body>
</soapenv:Envelope>
